In [1]:
import pandas as pd
import geopandas as gpd
import numpy as np
import folium
import os

In [2]:
cali_full = pd.read_csv('data/metro_CA_2011_2018.csv')
cali_zcta = pd.read_csv(os.path.join('data/cali_ziptozcta.csv'), dtype={'zcta': object})
cali_geom = geoJSON_df = gpd.read_file('data/stanford-dc841dq9031-geojson.json')

In [3]:
cali_full.head(1)

,Date,aggregate_travel_time_to_work,amerindian_including_hispanic,amerindian_pop,armed_forces,asian_including_hispanic,asian_male_45_54,asian_male_55_64,asian_pop,associates_degree,...,vacant_housing_units_for_rent,vacant_housing_units_for_sale,walked_to_work,white_including_hispanic,white_male_45_54,white_male_55_64,white_pop,worked_at_home,workers_16_and_over,Zipcode
0,2011,659055.0,309,19,0,59,0,0,48,903,...,396,129,566,40379,0,0,465,426,20883,90001

In [4]:
cali_zcta.head(1)

   Zipcode   zcta
0    90001  90001

In [5]:
cali_geom.head(1)

,id,objectid,cnty_fips,county,tract,tract_id,census_key,zcta,zcta_key,latitude,...,hu_vac,hu_vac_ren,hu_vac_sea,hu_occ_own,hu_occ_o_1,hu_occ_ren,hu_occ_r_1,shape_area,shape_len,geometry
0,dc841dq9031.1,1,None,None,None,None,None,94601,0694601,37.776711,...,1536,839,28,4764,16528,10062,32927,8.721649e+06,15265.09388,"MULTIPOLYGON (((-122.22717 37.79197, -122.2269..."

In [6]:
cali_zcta = cali_zcta.merge(cali_geom, on = 'zcta', how = 'left')
cali_zcta = cali_zcta[['Zipcode', 'zcta', 'geometry']]

In [7]:
cali_zcta.head(1)

   Zipcode   zcta                                           geometry
0    90001  90001  MULTIPOLYGON (((-118.23795 33.96015, -118.2385...

In [8]:
cali_full = cali_full.merge(cali_zcta, on = 'Zipcode', how = 'left')

In [9]:
cali_full['Zipcode'].value_counts()

90001    8
92841    8
92807    8
92808    8
92821    8
        ..
91763    8
91764    8
91765    8
91766    8
96150    8
Name: Zipcode, Length: 764, dtype: int64